GHB2/src/Catalogs/гхб_ФизическиеЛица/гхб_ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ФизЛицаСОшибками</name>
      <description>Физ. лица с ошибками</description>
    </items>
    <items>
      <name>СырыеДанные</name>
      <description>Сырые данные</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.гхб_ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/InformationRegisters/гхб_СписокФайлов/гхб_СписокФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СписокФайлов</name>
  <resources>
    <name>ПолноеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяФайлаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Родитель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписанЭЦП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КаталогСохранения</name>
    <type>
      <types>CatalogRef.гхб_СлужебныеЗначения</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипДанных</name>
    <type>
      <types>EnumRef.гхб_ТипыДанныхФайлов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛицаБазХолдинга</types>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
      <types>DocumentRef.гхб_ЗакреплениеОтветственногоЗаПомещение</types>
      <types>DocumentRef.гхб_ЗакреплениеСтатусаКонсервацииПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыДанныхФайлов/гхб_ТипыДанныхФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыДанныхФайлов</name>
  <enumValues>
    <name>ФотоФизЛица</name>
  </enumValues>
  <enumValues>
    <name>Картинка</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Catalogs/гхб_ФизическиеЛица/ManagerModule.bsl
//++ a.romanchuk 25.05.2020 #
Функция ВернутьПутьКФотоФизЛица(_Ссылка) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	гхб_СписокФайлов.КаталогСохранения.Значение КАК КаталогСохраненияЗначение,
	               |	гхб_СписокФайлов.ПолноеИмяФайла КАК ПолноеИмяФайла
	               |ИЗ
	               |	РегистрСведений.гхб_СписокФайлов КАК гхб_СписокФайлов
	               |ГДЕ
	               |	гхб_СписокФайлов.ВладелецФайла = &ВладелецФайла
	               |	И гхб_СписокФайлов.ТипДанных = ЗНАЧЕНИЕ(Перечисление.гхб_ТипыДанныхФайлов.ФотоФизЛица)";
	
	Запрос.УстановитьПараметр("ВладелецФайла", _Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.КаталогСохраненияЗначение + Выборка.ПолноеИмяФайла, "");
	
КонецФункции
//-- a.romanchuk 25.05.2020 #
